In [2]:
import numpy  as np
import pandas as  pd

In [3]:
from pandas import DataFrame, Series

## 假设有两份成绩单，除了ddd是张三李四王老五之外，还有ddd4是张三和赵小六的成绩单，如何合并？

In [4]:
columns = ['张三', '李四', '王老五']
index = ['语文', '数学', '英语']
data = np.random.randint(0,150, size=(3,3))
ddd = DataFrame(data=data, index=index, columns=columns)
ddd

     张三   李四  王老五
语文   33  121   24
数学  108   91  131
英语    5    9  101

In [5]:
columns = ['张三',  '赵小六']
index = ['语文', '数学', '英语']
data = np.random.randint(0,150, size=(3,2))
ddd4 = DataFrame(data=data, index=index, columns=columns)
ddd4

    张三  赵小六
语文  45  120
数学  70   17
英语  95  120

In [6]:
ddd4['张三'] =  ddd['张三']
ddd4

     张三  赵小六
语文   33  120
数学  108   17
英语    5  120

In [7]:
pd.merge(ddd, ddd4)

    张三   李四  王老五  赵小六
0   33  121   24  120
1  108   91  131   17
2    5    9  101  120

## 如果ddd4中张三的名字被打错了，成为了张十三，怎么办？

In [8]:
columns = ['张十三',  '赵小六']
index = ['语文', '数学', '英语']
data = np.random.randint(0,150, size=(3,2))
ddd4 = DataFrame(data=data, index=index, columns=columns)
ddd4

    张十三  赵小六
语文  122    1
数学  128   30
英语   55   70

In [9]:
ddd4['张十三'] =  ddd['张三']
ddd4

    张十三  赵小六
语文   33    1
数学  108   30
英语    5   70

In [11]:
pd.merge(ddd, ddd4, left_on='张三', right_on='张十三').drop(columns='张十三')

    张三   李四  王老五  赵小六
0   33  121   24    1
1  108   91  131   30
2    5    9  101   70

## 假设有两个同学都叫李四，ddd5、ddd6都是张三和李四的成绩表，如何合并？

In [12]:
columns = ['张三',  '李四']
index = ['语文', '数学', '英语']
data = np.random.randint(0,150, size=(3,2))
ddd5 = DataFrame(data=data, index=index, columns=columns)
ddd5

     张三   李四
语文  134  128
数学  132   87
英语   49  130

In [13]:
columns = ['张三',  '李四']
index = ['语文', '数学', '英语']
data = np.random.randint(0,150, size=(3,2))
ddd6 = DataFrame(data=data, index=index, columns=columns)
ddd6

     张三   李四
语文  134   69
数学    7  105
英语  122   10

In [14]:
ddd5['张三'] =  ddd6['张三']
ddd5

     张三   李四
语文  134  128
数学    7   87
英语  122  130

In [16]:
result = pd.merge(ddd5, ddd6, on='张三', suffixes=['_一班', '二班'])
result.index = ddd5.index
result

     张三  李四_一班  李四二班
语文  134    128    69
数学    7     87   105
英语  122    130    10

In [17]:
pd.merge(ddd5, ddd6, on='张三', suffixes=['_一班', '二班'], left_index=True)

     张三  李四_一班  李四二班
语文  134    128    69
数学    7     87   105
英语  122    130    10